{"id":112,"date":"2015-05-12T13:50:03","date_gmt":"2015-05-12T11:50:03","guid":{"rendered":"http:\/\/genesiswp.guide\/?p=112"},"modified":"2015-05-12T17:16:20","modified_gmt":"2015-05-12T15:16:20","slug":"srikat-interview","status":"publish","type":"post","link":"https:\/\/genesiswp.guide\/srikat-interview\/","title":{"rendered":"An interview with Sridhar Katakam"},"content":{"rendered":"<div id=\"fb-root\"><\/div>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-114\" src=\"http:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/srikat.jpg\" alt=\"Sridhar Katakam and family!\" width=\"660\" height=\"440\" srcset=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/srikat.jpg 660w, https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/srikat-300x200.jpg 300w\" sizes=\"(max-width: 660px) 100vw, 660px\" \/><\/p>\n<p><strong>If you&#8217;ve spent any time in the Genesis community in the last couple of years, there&#8217;s probably one name you&#8217;ll see more often than most: <a href=\"http:\/\/twitter.com\/srikat\" target=\"_blank\">Sridhar Katakam<\/a>.<\/strong><\/p>\n<p>Also known as <a href=\"http:\/\/twitter.com\/srikat\" target=\"_blank\">@srikat<\/a> on Twitter, Sridhar has been a one man code tutorial posting, support forum helping, social media whirlwind since he first started posting Genesis tutorials on his website back in July 2013.<\/p>\n<p>Sharing tutorials on an almost daily basis, he quickly established authority and credibility in the community with the breadth and depth of what he was sharing.<\/p>\n<p>Then, in February 2015, he decided to create a paid membership site out of those tutorials. Less than three months later, he shared the good news on Twitter that <a href=\"https:\/\/twitter.com\/srikat\/status\/594036426850729984\" target=\"_blank\">things were going so well he was no longer looking for forum\/help desk support jobs<\/a>.<\/p>\n<p>With his genuine love of helping people clearly apparent, it&#8217;s difficult not to root for this self taught coder now helping hundreds of other people get better at coding every month.<\/p>\n<p>That&#8217;s why I couldn&#8217;t be happier that he agreed to tell me more about how he got into Genesis (including hating it at first!), the success of his membership site and his plans for the future.<\/p>\n<p>I hope you enjoy it.<\/p>\n<hr \/>\n<h2>I think a lot of people reading this will know who you are(!), but for those that maybe don’t, can you tell people a little bit about yourself, where you live, what you do and what you do for fun (outside of playing with code :)?<\/h2>\n<blockquote><p>First of all, thank you Nick for giving me an opportunity to voice my opinions and thoughts.<\/p>\n<p>After my Bachelor’s in Industrial Production Engineering in India, I studied Master’s in Mechanical Engineering at USF, Tampa. I used to work as a helper in university bookstore and as a Teaching Assistant in Dynamics of Machinery lab during that time.<\/p>\n<p>We had to build a HTML page to show the results in Heat Transfer class and I learnt HTML from <a href=\"http:\/\/www.htmlgoodies.com\/primers\/html\/article.php\/3478131\" target=\"_blank\">HTMLGoodies<\/a> site and CSS from <a href=\"http:\/\/www.brainjar.com\/css\/using\/\" target=\"_blank\">BrainJar<\/a>. After that I started researching on various CMSs and scripts like PHPNuke, PostNuke, Drupal, Mambo, Typo 3, Menalto Gallery, Movable Type, WordPress out of interest.<\/p>\n<p>Trying out various CMS at opensourcemcms.com was my hobby. I started taking up projects in freelancing websites like RentACoder and GetAFreelancer. Eventually dropped out of Master’s as I had no interest whatsoever in doing the Thesis and moved back to India.<\/p>\n<p>In India I worked as a recruiter during nights for a couple of months, then as a webmaster at SumTotal, then as a UI Designer at SAP Labs India, then as a support moderator at iThemes taking care of Builder theme support and finally switched to Genesis.<\/p>\n<p>I am 37 and currently live in Melbourne, Australia with my wife and a 7 year old daughter.<\/p>\n<p>I do PSD to WP conversions, primarily for <a href=\"http:\/\/thedma.com.au\" target=\"_blank\">the DMA<\/a>, take up Genesis customizations via <a href=\"http:\/\/genesiscustomizations.com\/\" target=\"_blank\">GenesisCustomizations.com<\/a> and write tutorials on Genesis and WordPress at <a href=\"https:\/\/sridharkatakam.com\/\" target=\"_blank\">sridharkatakam.com<\/a>.<\/p>\n<p>During my free time which is usually, during lunch and dinner, I watch movies (mostly Indian). I follow the happenings in mobile industry (Apple, Android etc.). I also like playing table tennis and chess.<\/p><\/blockquote>\n<h2>For me, and probably a lot of people, you’re most well known for the sheer volume and quality of great code tutorials that you share. Using them as the foundation you launched a paid membership site in February 2015, for those that don’t know about the project can you tell people a little bit more about that?<\/h2>\n<blockquote><p>Like with two or three of my earlier sites, <a href=\"https:\/\/sridharkatakam.com\/\" target=\"_blank\">sridharkatakam.com<\/a> also started as a place where I document and share my findings and code experiments with the rest of the world.<\/p>\n<p>I do not have a formal coding knowledge or background and hence every time I figure out something new I have this irresistible urge to share it with others who might tread that path and save themselves a lot of time and frustration.<\/p>\n<p>One of the main reasons I converted my site into a membership site is to reduce the amount of requests for coding help in the comments. I did not like the idea of turning comments off or ignoring the people that were asking for help. There are only so many hours in a day to help everyone. Introducing a small amount of monthly fee to access my tutorials, I felt, is a good way to let only those in that are genuinely interested.<\/p>\n<p>I think my site’s target audience is primarily web designers and developers that build websites for others.<\/p><\/blockquote>\n<h2>After launching the membership site I think the reaction from pretty much everybody has been incredible (and deservedly so). I don’t want to focus on it too much but, as it’s kind of part of the journey of where you got to today, how did you feel when you got that one (ridiculous) initial bit of negative feedback on Twitter when you first suggested the idea? And then later so many people came out to support you (including Brian Gardner, Lauren Mancke and Carrie Dils on Genesis Office Hours), that must’ve helped?<\/h2>\n<blockquote><p>Frankly I did not understand why that guy had a problem with me removing free access to the content I wrote in my site. It’s not like I am forcing anybody to join. As a matter of fact, I do not even have an ‘About’ Page or a formal launch\/announcement post in my site or social media. All the 600+ members that have joined did because they knew the value of what I write and via word of mouth.<\/p>\n<p>I did not feel discouraged by that incident though. There are better things to worry about in this world. Yes, the support offered by Genesis community has been tremendous!<\/p><\/blockquote>\n<h2>You recently came out and shared the fantastic news you’re no longer taking on support work due to the membership site’s success with over $6,000 of revenue in April. That must feel incredible. Now you’ve got in this position do you have further goals (financial or otherwise) for the site?<\/h2>\n<blockquote><p>When I wrote I am no longer looking for support jobs, I meant I am not going to actively seek work in the role of a support person in WordPress companies like Automattic. I still undertake Genesis customizations work if my time permits.<\/p>\n<p>I do not have a monetary goal for my site. I only strive to publish at least 1 useful tutorial every day. Looking into the future, if the revenue grows to a consistent $10,000 a month I may stop taking up client work + theme customizations work and concentrate fully on the membership by adding step-by-step videos, more content, learning paths etc.<\/p><\/blockquote>\n<h2>You’re clearly providing a lot of value to people with what you share, Brian Gardner called it out as a clear “return on investment” and I think that’s very true. Given the value that people are clearly getting out of your site, do you have any plans to raise the price for new members in future? What are you thoughts on pricing in general?<\/h2>\n<blockquote><p>I help people in StudioPress forums, over Twitter, in Facebook and Google+ Genesis groups and in Slack because I genuinely want to and like it. I have never planned or worked towards converting the site into a membership site. I do not consider my website as a business and my help to others via tutorials, an investment. It just happened to go in that direction.<\/p>\n<p>Regarding plans for increasing the price, not in the near future.<\/p>\n<p>I always want my writing to be helpful to as many people as possible. No amount of money will give me as much satisfaction and make me as much happier than to know that one of my tutorials has helped someone while I am asleep.<\/p>\n<p>1000 users paying $10 each or 200 paying $50 each would get me the same net amount. But I will be helping 800 people more by keeping the price $10 per month. Support will not be a problem because this is the price for only accessing the tutorials.<\/p>\n<p>The first day I added the membership, I set the price to $47 a month which is what I thought as a fair price for what I offer. Maybe after six months, I may raise the price from the current $10 a month to $27 and then eventually to $47 after a couple of years. We will see&#8230; Basic membership will remain the same $10 for those who subscribed at that price.<\/p><\/blockquote>\n<h2>When you were coming up with idea for the membership site were you inspired by any other businesses in particular, either inside or outside of WordPress?<\/h2>\n<blockquote><p>No. I am not a paying member of any membership site at the moment.<\/p>\n<p>The hardest part of a membership site is the content and I had lots of it &#8211; content that is useful, clear and practical. All I had to do was install a plugin and configure it.<\/p><\/blockquote>\n<h2>For those reading this that might be thinking of launching their own Genesis or WordPress focussed business, what advice would you give them?<\/h2>\n<blockquote><p>As someone said, passion without profit is a hobby. So congratulate yourself now that you have decided to monetize your expertise. Genuinely help others by offering value and rest falls in place automatically.<\/p>\n<p>There is a huge market for services and training businesses specializing in Genesis. Go for it.<\/p><\/blockquote>\n<h2>For the techies amongst us, what plugins \/ solutions are you using to deliver your membership site and forums at the moment? Any plans to change solutions? Anything you wished you’d done differently in hindsight?<\/h2>\n<blockquote><p>I started with Paid Memberships Pro but after realizing how limited it is (features and documentation wise), switched to the more powerful MemberPress.<\/p>\n<p>Many of the features that MemberPress has out of the box (like members belonging to multiple products\/levels) are yet to be implemented in PMP.<\/p>\n<p>For the forums, am using bbPress. I am quite happy with the way these are working at the moment.<\/p>\n<p>Adding PayPal Premier account with Digital Goods support gave me the hardest time and caused me a loss of at least $5000 due to PayPal’s inability to fix a problem with recurring payments on their end.<\/p>\n<p>After a frustrating wait of 1.5 months or so, I switched to the simpler and more importantly, working PayPal Standard.<\/p><\/blockquote>\n<h2>Moving back to Genesis, you’ve been posting code tutorials for it since 2013. What was the initial appeal of working with Genesis and what is the appeal today?<\/h2>\n<blockquote><p>At first I hated it. See <a href=\"http:\/\/pixelyzed.com\/2013\/05\/16\/the-state-of-my-2013-wordpress-toolset-themes\/#comment-5049\" target=\"_blank\">http:\/\/pixelyzed.com\/2013\/05\/16\/the-state-of-my-2013-wordpress-toolset-themes\/#comment-5049<\/a>.<\/p>\n<p>In July 2013 when Catalyst (earlier Frugal) became Dynamik and embraced Genesis, I tried Genesis again via Dynamik and thought it was ok.<\/p>\n<p>This period also happened to be the time when I parted ways with iThemes and I was looking to move away from Builder.<\/p>\n<p>By August I was actively going through StudioPress forums, trying to re-create the user’s issues and come up with answers. My first tutorial on Genesis was in August 2013. Seeing close to 60 comments for it encouraged me and after that there was no turning back.<\/p>\n<p>The biggest appeal today to me, is the clean HTML output that Genesis produces. Thanks to actions and filters, we can create a custom WordPress website in Genesis with minimal amount of code changes &#8211; easily and quickly.<\/p>\n<p>Genesis probably does not appear easy or intuitive at first, but if one sticks to it, there is a tremendous potential in it.<\/p>\n<p>Is it perfect? No. Please ask Gary Jones for further details on that 😉<\/p><\/blockquote>\n<h2>You’ve clearly know a lot about Genesis and web development in general, but when you’re stuck with something who do you typically reach out to for help?<\/h2>\n<blockquote><p>Google, Slack, Twitter, StackExchange, Forums &#8211; in that order.<\/p><\/blockquote>\n<h2>What’s the best way for people to follow what you’re doing if they want to learn more?<\/h2>\n<blockquote><p>I am all over the internet in Genesis communities on <a href=\"http:\/\/twitter.com\/srikat\" target=\"_blank\">Twitter<\/a>, <a href=\"https:\/\/www.facebook.com\/groups\/genesiswp\/\" target=\"_blank\">Facebook<\/a>, <a href=\"https:\/\/plus.google.com\/u\/1\/communities\/113206330486200023679\" target=\"_blank\">Google+<\/a>, <a href=\"https:\/\/sridharkatakam.com\/how-to-join-genesis-live-chat-in-slack\/\" target=\"_blank\">Slack<\/a> and Skype. I am most active on Slack though.<\/p>\n<p>The best way for people to get notified about new tutorials I publish is by subscribing using the form in my site’s sidebar.<\/p><\/blockquote>\n<h2>Finally, the most important question of all: Game of Thrones or Downton Abbey?<\/h2>\n<blockquote><p>What are those? I am guessing TV shows?<\/p><\/blockquote>\n<hr \/>\n<p>If you&#8217;re in the Genesis community and thinking of starting a new business (or side project), I hope that Sridhar&#8217;s story inspires you.<\/p>\n<p>I also just want to take a moment to thank Sridhar for taking the time and being very generous with his answers and in sharing his story.<\/p>\n<p>If you have any questions or comments about the interview please feel free to leave a comment below (and I&#8217;ll try to pester him to come and answer any questions) or get in touch with him on Twitter <a href=\"http:\/\/twitter.com\/srikat\" target=\"_blank\">@srikat<\/a>.<\/p>\n<p>Or better yet, if you haven&#8217;t already, <a href=\"https:\/\/sridharkatakam.com\/membership\/\" target=\"_blank\">join his membership site<\/a> (before he puts the price up!). If you&#8217;re working regularly with Genesis, I am sure you&#8217;ll find it a tonne of value.<\/p>\n<p><em><strong>PS<\/strong> If you&#8217;d like to read more interviews with some of the most awesome people in Genesis just subscribe below and get all the awesomeness straight in your inbox twice a week.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Sridhar Katakam (aka @srikat) talks membership site success, how you can succeed in your own WordPress business and how he got into Genesis.<\/p>\n","protected":false},"author":2,"featured_media":114,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[16],"tags":[],"jetpack_featured_media_url":"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/srikat.jpg","yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Sridhar Katakam (aka @srikat) talks membership site success, how you can succeed in your own WordPress business and how he got into Genesis.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/genesiswp.guide\/srikat-interview\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"An interview with Sridhar Katakam\" \/>\n<meta property=\"og:description\" content=\"Sridhar Katakam (aka @srikat) talks membership site success, how you can succeed in your own WordPress business and how he got into Genesis.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/genesiswp.guide\/srikat-interview\/\" \/>\n<meta property=\"og:site_name\" content=\"GenesisWP.guide\" \/>\n<meta property=\"article:published_time\" content=\"2015-05-12T11:50:03+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-05-12T15:16:20+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/srikat.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"660\" \/>\n\t<meta property=\"og:image:height\" content=\"440\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/genesiswp.guide\/#website\",\"url\":\"https:\/\/genesiswp.guide\/\",\"name\":\"GenesisWP.guide\",\"description\":\"The best new WordPress Genesis things\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/genesiswp.guide\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/genesiswp.guide\/srikat-interview\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/srikat.jpg\",\"width\":660,\"height\":440,\"caption\":\"Sridhar Katakam and family!\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/genesiswp.guide\/srikat-interview\/#webpage\",\"url\":\"https:\/\/genesiswp.guide\/srikat-interview\/\",\"name\":\"An interview with Sridhar Katakam - GenesisWP.guide\",\"isPartOf\":{\"@id\":\"https:\/\/genesiswp.guide\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/genesiswp.guide\/srikat-interview\/#primaryimage\"},\"datePublished\":\"2015-05-12T11:50:03+00:00\",\"dateModified\":\"2015-05-12T15:16:20+00:00\",\"author\":{\"@id\":\"https:\/\/genesiswp.guide\/#\/schema\/person\/b5cc53502a0c6971db47f22c6d57babb\"},\"description\":\"Sridhar Katakam (aka @srikat) talks membership site success, how you can succeed in your own WordPress business and how he got into Genesis.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/genesiswp.guide\/srikat-interview\/\"]}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/genesiswp.guide\/#\/schema\/person\/b5cc53502a0c6971db47f22c6d57babb\",\"name\":\"Nick Davis\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/genesiswp.guide\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/015e3d0d2b959afa2ce18901b2d64ab2?s=96&d=mm&r=g\",\"caption\":\"Nick Davis\"},\"description\":\"Nick has been playing with websites since 1997, WordPress since 2010 and still hasn't broken the Internet. Tweet him up at @iamnickdavis.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts\/112"}],"collection":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/comments?post=112"}],"version-history":[{"count":0,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts\/112\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/media\/114"}],"wp:attachment":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/media?parent=112"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/categories?post=112"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/tags?post=112"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}