{"id":179,"date":"2015-07-27T16:19:12","date_gmt":"2015-07-27T14:19:12","guid":{"rendered":"http:\/\/genesiswp.guide\/?p=179"},"modified":"2015-07-27T16:37:53","modified_gmt":"2015-07-27T14:37:53","slug":"meet-lindsey-riel","status":"publish","type":"post","link":"https:\/\/genesiswp.guide\/meet-lindsey-riel\/","title":{"rendered":"Meet Lindsey Riel (and win awesome things!)"},"content":{"rendered":"<div id=\"fb-root\"><\/div>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-180\" src=\"http:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/07\/lindsey-riel.jpg\" alt=\"Lindsey Riel\" width=\"660\" height=\"440\" srcset=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/07\/lindsey-riel.jpg 660w, https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/07\/lindsey-riel-300x200.jpg 300w\" sizes=\"(max-width: 660px) 100vw, 660px\" \/><\/p>\n<p><strong>This week I&#8217;m really happy to be able to share an interview with <a href=\"https:\/\/twitter.com\/lindseyriel\" target=\"_blank\">Lindsey Riel<\/a>, creator of <a href=\"http:\/\/prettydarncute.com\/\" target=\"_blank\">Pretty Darn Cute<\/a>, one of the best and smartest people you&#8217;ll find when it comes to creating fantastic WordPress Genesis themes and services.<\/strong><\/p>\n<p>For many of you, Lindsey won&#8217;t need any introduction of course. But for those that do, as designer and founder of Pretty Darn Cute she&#8217;s been producing eye-catching Genesis themes for WordPress longer than most of her contemporaries.<\/p>\n<p>And that experience and commitment shows today in both the great business that&#8217;s she built and the seemingly endless number of passionate <a href=\"http:\/\/prettydarncute.com\/pretty-darn-happy-customers\/\" target=\"_blank\">testimonials<\/a> you&#8217;ll find describing her work.<\/p>\n<p>If you make and sell WordPress themes or are thinking of doing so I think you&#8217;ll find a tonne of value in this interview especially.<\/p>\n<p>Lindsey also works closely with Susan Ramsey &#8211; one of the most well known names in Genesis &#8211; and shares her experience working with her too.<\/p>\n<p>But whatever your place in the WordPress or Genesis communities I encourage you to read through Lindsey&#8217;s candid and honest answers because there&#8217;s a lot of value there for everyone.<\/p>\n<p>Finally, not only was Lindsey generous in sharing her time while still catching up with life after a recent move across the country, she also offered to do a competition too (more on that at the end of the interview).<\/p>\n<p>Without further ado, I&#8217;m delighted to share my Q&amp;A with Lindsey.<\/p>\n<p>I hope you enjoy.<\/p>\n<hr \/>\n<p><strong>NICK: When I first came across your site (probably a few years ago now!) at that point I think you were still ‘client projects’ first and ‘pre-made themes’ second. Now of course you’ve very much made the switch to pre-made themes first and have been that way for a while. I know <a href=\"http:\/\/officehours.fm\/podcast\/5-2\/\" target=\"_blank\">when you spoke to Carrie Dils on Genesis Office Hours<\/a> (now OfficeHours.fm) last year, you said the change was a lot to do with the good problem of not having time for all the client projects. Now a little more time has passed can you tell me a bit more about what it’s been like for you and the business since making that decision? (Presumably a good one!)<\/strong><\/p>\n<p>LINDSEY: Transitioning to creating pre-made themes from client work has undoubtedly been the best decision I ever made.<\/p>\n<p>It was in my mind from the beginning but I had to wait until the time was right, which was after several years of working with high profile bloggers from all genres and connecting with the best in the business, <a href=\"http:\/\/www.studiopress.com\/\" target=\"_blank\">StudioPress<\/a>.<\/p>\n<p>I didn’t want to just create a pretty theme, I aimed to provide function and ease of use. I think a lot of people jump on the pre-made wagon and assume it’s simply a matter of selling the visual aspect.<\/p>\n<p>While that is important, it is not what will keep your customers returning. Anyone can sell pre-made themes.<\/p>\n<p>The market is now flooded, however, my business continues to thrive.<\/p>\n<p>I attribute that continued success to a desire to help people take control of their website. I realised there are many small tasks that web owners see as huge hurdles, that I could completely eliminate for them through my design.<\/p>\n<p>Beyond design, and function, support has always been most important. I was fortunate enough to start out handling theme support through the <a href=\"http:\/\/www.studiopress.com\/forums\/\" target=\"_blank\">StudioPress forums<\/a> which allowed me to watch how some of the most intelligent people in our field handled support questions, and then model that behaviour for my customers.<\/p>\n<p>More on this later, but Susan Ramsey handling support for PDCD has been nothing short of amazing.<\/p>\n<p><strong>What’s been the biggest unexpected challenge (if you’ve had one!) in making the switch?<\/strong><\/p>\n<p>Initially it was handling the business end of things, support was taking most of my time every day because I had not yet learned how to anticipate the type of questions people would be asking.<\/p>\n<p>I would say it took me a good year to nail down exactly what should be covered on the theme setup instruction pages, but I continue to learn with each theme release and build upon that knowledge to help make our customer experience as simple, and enjoyable, as possible.<\/p>\n<p>When it comes to building, polishing, and perfecting I will never be satisfied. In the most positive way.<\/p>\n<p>Present day, I do not see anything as a hurdle, but more of a challenge, and I am always excited to divide and conquer.<\/p>\n<p><strong>I think one of the biggest concerns people have about opening a theme shop is that they might get swamped with support requests! How has that been for you? I know you also have Genesis community legend(!) <a href=\"https:\/\/twitter.com\/graphdesigning\" target=\"_blank\">Susan Ramsey<\/a> helping you with that, that must be fantastic?<\/strong><\/p>\n<figure id=\"attachment_181\" aria-describedby=\"caption-attachment-181\" style=\"width: 300px\" class=\"wp-caption alignright\"><img loading=\"lazy\" class=\"wp-image-181 size-medium\" src=\"http:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/07\/lindsey-susan-300x300.jpg\" alt=\"Susan &amp; Lindsey\" width=\"300\" height=\"300\" srcset=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/07\/lindsey-susan-300x300.jpg 300w, https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/07\/lindsey-susan-150x150.jpg 150w, https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/07\/lindsey-susan.jpg 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><figcaption id=\"caption-attachment-181\" class=\"wp-caption-text\">Susan &amp; Lindsey<\/figcaption><\/figure>\n<p>Absolutely. Susan is truly the best and words really do not do her justice.<\/p>\n<p>Beyond having the patience of a saint, she knows the answer to any question you throw at her. She has taken the stress, and even thought, of support completely off my plate. The PDCD support desk is hers, and she’s a rockstar at running that thing.<\/p>\n<p>The experience of creating pre-mades for as many years as I have when it comes to creating the setup tutorials, combined with Susan’s expertise, make for the ultimate in available knowledge for our customers.<\/p>\n<p>Susan keeps me updated on frequent questions people are asking, any errors in my instructions or plugins that have been deprecated etc. Together we are an amazing team, and I could not function without her.<\/p>\n<p><strong>A lot of Genesis developers (<a href=\"http:\/\/leanthemes.co\" target=\"_blank\">including myself!<\/a>) have experimented with selling pre-made themes either as side project or something they hope to grow into their main income. Now you’ve made that shift from client projects to pre-made themes what advice, if any, would you give to others who are thinking of maybe making the same transition?<\/strong><\/p>\n<p>I think it is important to make sure you are designing for your audience, to have a stellar support system in place, and be as available as possible to really tune into what it is you can improve upon constantly.<\/p>\n<p>The desire to get better, the passion to create, that’s what keeps me going.<\/p>\n<p>The business end of things is not going to succeed if the creative side does not drive you.<\/p>\n<p><strong>I know that you also offer some standard services alongside theme sales which seem really well thought out, like 24 hour setup, the <a href=\"http:\/\/prettydarncute.com\/product\/tada-online-wordpress-workshop\/\" target=\"_blank\">TADA! Online Workshop<\/a> (which includes access to videos on setting up the sites etc), have these been popular for you?<\/strong><\/p>\n<p>TADA! has been a pleasant surprise.<\/p>\n<p>Going along with what I mentioned previously, I wanted to help others take control of their sites.<\/p>\n<p>Once I transitioned to pre-made development from client work, I kept a few clients\/friends and I am always sending them tips and tutorials.<\/p>\n<p>Things to help them streamline their daily blog posts, placing ads, awesome plugins, the best way to resize images and so on. I want them to have the best of everything, so I would spend hours creating tutorials and emailing them.<\/p>\n<p>I realized there are so many who could benefit from knowing these things, and I was already investing the time and effort, so just like that TADA! was born.<\/p>\n<p>I’m very happy with the amount of sales, and positive feedback TADA! has generated.<\/p>\n<p>Our 24 hour setup package has also been successful and that is entirely Susan. She handles every single one, and she does so expertly.<\/p>\n<p><strong>Do you set yourself particular goals for PDCD as a business, for example, in six or twelve months from now? I know a lot of people that are happy to hit a certain size and then feel that’s OK for them. They don’t want to manage too many staff or end up outsourcing a load of stuff. Of course, these are good problems to have(!) but would you want to keep growing PDCD if you can or do you have in your mind a particular point that you’re happy with?<\/strong><\/p>\n<p>I actually ask myself this question often, but that is the extent of my goal planning. Thinking about expansion, what I can do to improve and so on.<\/p>\n<p>I know a lot of developers pump a new theme out weekly, create launch deadlines etc. and that works for them, but I am not a timeline kind of gal. Which is another reason premade development works so perfectly for me.<\/p>\n<p>I always tell my husband creativity can have no timeline. Especially when the dishes are overflowing, and the laundry is piled high.<\/p>\n<p>I will never allow myself to become complacent, and while I would love to be the Martha Stewart of web development, I do not feel the pressure to force that sort of expansion.<\/p>\n<p>If I’m launching a new theme, it’s because I’ve put my heart and soul into it and feel like it’s ready for consumption. Not because I felt like I had to, or like it was time.<\/p>\n<p><strong>Aside from your online work, I think one of the most interesting things you’ve done is the TADA! workshop where people come along and get their website completely set up in a single day. How did that go? I know that you also have the online TADA! Workshop package too but do you think you’ll do any other live events?<\/strong><\/p>\n<p>The one day workshop was a blast!<\/p>\n<p>Susan and I had a lot of fun, and are still in touch with most all of the attendees. We made lifelong friends, and helped people which we saw as a successful day.<\/p>\n<p>What we noticed was most of the attendees already had their sites up and were looking to tweak them, and better understand how things work.<\/p>\n<p>When I planned our second workshop it was more centered on what we now offer in the online version.<\/p>\n<p>Unfortunately, I had to cancel that event a few days after launching the signup due to my husband receiving (Military) orders with conflicting dates for our move to the North East.<\/p>\n<p>The live events are a lot of fun, and we are able to be more one on one with people after the presentations. I would love to have another one soon, it’s always in the back of my mind.<\/p>\n<p><strong>Since Copyblogger launched the Rainmaker Platform last year there’s been a lot of talk in the Genesis community about it. Is that something you’ve worked on with any clients? Do you have any plans for PDCD and Rainmaker, like developing Rainmaker specific themes, for example?<\/strong><\/p>\n<p>I have heard nothing but amazing things about Rainmaker, and I know the people behind it put 100% into everything they do. I personally have not had a chance to dig into it and “play”, but absolutely look forward to working with Rainmaker in the future.<\/p>\n<p><strong>I interviewed <a href=\"https:\/\/twitter.com\/bgardner\" target=\"_blank\">Brian Gardner<\/a> last year and I don’t know if you know but he mentioned <a href=\"https:\/\/twitter.com\/billerickson\" target=\"_blank\">Bill Erickson<\/a>, <a href=\"https:\/\/twitter.com\/cdils\/\" target=\"_blank\">Carrie Dils<\/a> and yourself as the three people to really watch and learn from if you want to develop a business in the Genesis space. In particular he highlighted things you guys are all doing well like well thought out business models, branding, content marketing, being active in the community etc. I know that a lot of designers and developers don’t always have a natural affinity for the business side of things, preferring to focus on the immediate work in front of them. Is that something you found hard to pick up or a big mindset shift to have to make? Are there any particular people or businesses, either inside WordPress or out, that you look up to or try to learn from in terms of marketing, business strategy etc?<\/strong><\/p>\n<p>Wow, that is a huge compliment coming from Brian and to be included with the likes of Bill Erickson and Carrie Dils.<\/p>\n<p>I would not have the business I have today if it weren’t for Brian Gardner.<\/p>\n<p>He is one of those rare, genuinely kind, insanely creative and helpful people you meet in life and I consider myself lucky to know him.<\/p>\n<p>As far as how I model my business, again, I had the advantage of learning from the best at StudioPress early on.<\/p>\n<p>I continue to watch and learn from them, as well as listen to my customers. Through Brian I found the genius of <a href=\"https:\/\/twitter.com\/sugarrae\" target=\"_blank\">Rae Hoffman<\/a>, <a href=\"http:\/\/www.copyblogger.com\/\" target=\"_blank\">Copyblogger<\/a>, and numerous others who are the best at business and provide resources for people like me to continue learning every day.<\/p>\n<p>Man this is beginning to sound like a StudioPress promo, but truly StudioPress and the Genesis Framework are the central point of success in my case.<\/p>\n<p><strong>Perhaps not surprisingly, given the name Pretty Darn Cute Design(!), one of the stand out things about PDCD is the designs you create. I know you’ve said that you’ve always had an inherent desire to be creative, but is design something you feel you’ve always been good at? Did you have any formal training?<\/strong><\/p>\n<p>Thank you!<\/p>\n<p>The funny thing about feeling like you are good at design is you will undoubtedly look back and think your past work is just awful, sometimes even only a week later. Ha!<\/p>\n<p>That said, I have always believed in my ability and been confident that what I did not know, or do well, I would learn and improve upon.<\/p>\n<p>I have not had any formal training, but I have had years of some pretty awesome trial and error. I would not trade those frustrating nights of learning on my own for a free ride to the best design school out there.<\/p>\n<p>I have always been good with computers. I started on my first Mac in kindergarten (lucky for me, a public school no less) and have never known life without them.<\/p>\n<p>I do not have the level of confidence I have when it comes to design in any other area of my life.<\/p>\n<p>In fact, I was once called “Mrs. Inferiority Complex” as a teenager and that is something I continue to struggle with today.<\/p>\n<p>When I found design, and more specifically web design, it just felt right. The perfect outlet for me.<\/p>\n<p><strong>Where and \/ or who do you look to for design inspiration?<\/strong><\/p>\n<p>Life, man.<\/p>\n<p>Billboards, magazines, furniture, shopping in general, connecting with other designers etc.<\/p>\n<p>The number one inspiration for my designs is usually found while browsing the internet.<\/p>\n<p>I’ve found fonts I love while researching recipes, techniques on makeup tutorial blogs, and so on.<\/p>\n<p><strong>For those of us that maybe aren’t designers but would like to get better at it would you recommend any particular way to learn or improve? Or should I us developer types just stick to the code and look to partner with awesome designers instead 🙂 ?<\/strong><\/p>\n<p>I think anyone can become great at anything with practice.<\/p>\n<p>Design is one of those things that is ever changing, so what you may be good at today can go out of style tomorrow. Which pretty much almost levels the playing field 🙂<\/p>\n<p>Admittedly, one needs to know the basics and experience that amazing trial and error thing so you’re able to quickly adapt to new trends.<\/p>\n<p><strong>What’s the best way for people to get in touch with you if they want to learn more?<\/strong><\/p>\n<p>Email, and I would love to chat: <a href=\"mailto:Lindsey@PrettyDarnCute.com\" target=\"_blank\">Lindsey@PrettyDarnCute.com<\/a><\/p>\n<p><strong>Finally, the most important question! Game of Thrones or Downton Abbey?<\/strong><\/p>\n<p>GOT! My Dad read the books years ago and was always quoting various characters, now I’m able to understand most of what he’s been saying for so long 😛<\/p>\n<p>I have not found enough quiet time since our cross country move to dig into Downton Abbey, but it’s next on my list. I’ve heard wonderful things!<\/p>\n<hr \/>\n<h2 id=\"giveaway\" style=\"text-align: center;\">Win a TADA! membership + any PDCD theme!<\/h2>\n<p style=\"text-align: center;\"><strong>For your chance of winning both a <a href=\"https:\/\/prettydarncute.com\/product\/tada-online-wordpress-workshop\/\" target=\"_blank\">TADA! membership<\/a> and <a href=\"https:\/\/prettydarncute.com\/genesis-themes\/\" target=\"_blank\">your choice of theme from Pretty Darn Cute<\/a> (a combined value of over $100) from Lindsey just enter your email address below.<\/strong><br \/>\n<em>(Competition closes 11:59pm PST, Sunday 2 August 2015)<\/em><\/p>\n<p style=\"text-align: center;\"><p>This giveaway has now finished *sad face*, but look out for new chances to win cool stuff in future articles *happy clap*.<\/p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Pretty Darn Cute creator, Lindsey Riel, on switching from client work to pre-made themes, working with Susan Ramsey, and where she finds design inspiration.<\/p>\n","protected":false},"author":2,"featured_media":180,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[16],"tags":[],"jetpack_featured_media_url":"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/07\/lindsey-riel.jpg","yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Pretty Darn Cute creator, Lindsey Riel, on switching from client work to pre-made themes, working with Susan Ramsey, and where she finds design inspiration.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/genesiswp.guide\/meet-lindsey-riel\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Meet Lindsey Riel (and win awesome things!)\" \/>\n<meta property=\"og:description\" content=\"Pretty Darn Cute creator, Lindsey Riel, on switching from client work to pre-made themes, working with Susan Ramsey, and where she finds design inspiration.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/genesiswp.guide\/meet-lindsey-riel\/\" \/>\n<meta property=\"og:site_name\" content=\"GenesisWP.guide\" \/>\n<meta property=\"article:published_time\" content=\"2015-07-27T14:19:12+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-07-27T14:37:53+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/07\/lindsey-riel.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"660\" \/>\n\t<meta property=\"og:image:height\" content=\"440\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/genesiswp.guide\/#website\",\"url\":\"https:\/\/genesiswp.guide\/\",\"name\":\"GenesisWP.guide\",\"description\":\"The best new WordPress Genesis things\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/genesiswp.guide\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/genesiswp.guide\/meet-lindsey-riel\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/07\/lindsey-riel.jpg\",\"width\":660,\"height\":440,\"caption\":\"Lindsey Riel\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/genesiswp.guide\/meet-lindsey-riel\/#webpage\",\"url\":\"https:\/\/genesiswp.guide\/meet-lindsey-riel\/\",\"name\":\"Meet Lindsey Riel (and win awesome things!)\",\"isPartOf\":{\"@id\":\"https:\/\/genesiswp.guide\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/genesiswp.guide\/meet-lindsey-riel\/#primaryimage\"},\"datePublished\":\"2015-07-27T14:19:12+00:00\",\"dateModified\":\"2015-07-27T14:37:53+00:00\",\"author\":{\"@id\":\"https:\/\/genesiswp.guide\/#\/schema\/person\/b5cc53502a0c6971db47f22c6d57babb\"},\"description\":\"Pretty Darn Cute creator, Lindsey Riel, on switching from client work to pre-made themes, working with Susan Ramsey, and where she finds design inspiration.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/genesiswp.guide\/meet-lindsey-riel\/\"]}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/genesiswp.guide\/#\/schema\/person\/b5cc53502a0c6971db47f22c6d57babb\",\"name\":\"Nick Davis\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/genesiswp.guide\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/015e3d0d2b959afa2ce18901b2d64ab2?s=96&d=mm&r=g\",\"caption\":\"Nick Davis\"},\"description\":\"Nick has been playing with websites since 1997, WordPress since 2010 and still hasn't broken the Internet. Tweet him up at @iamnickdavis.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts\/179"}],"collection":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/comments?post=179"}],"version-history":[{"count":0,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts\/179\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/media\/180"}],"wp:attachment":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/media?parent=179"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/categories?post=179"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/tags?post=179"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}