{"id":209,"date":"2015-09-21T14:30:38","date_gmt":"2015-09-21T12:30:38","guid":{"rendered":"http:\/\/genesiswp.guide\/?p=209"},"modified":"2015-09-21T14:27:03","modified_gmt":"2015-09-21T12:27:03","slug":"meet-lauren-gaige","status":"publish","type":"post","link":"https:\/\/genesiswp.guide\/meet-lauren-gaige\/","title":{"rendered":"Meet Lauren Gaige (and win a Genesis theme!)"},"content":{"rendered":"<div id=\"fb-root\"><\/div>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-213\" src=\"http:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/09\/lauren.jpg\" alt=\"Lauren Gaige\" width=\"660\" height=\"440\" srcset=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/09\/lauren.jpg 660w, https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/09\/lauren-300x200.jpg 300w\" sizes=\"(max-width: 660px) 100vw, 660px\" \/><\/p>\n<p><strong>Today I&#8217;m delighted to share an interview with one of the leading lights of the Genesis community, <a href=\"https:\/\/twitter.com\/restored316\" target=\"_blank\">Lauren Gaige<\/a>.<\/strong><\/p>\n<p>Not only is Lauren the founder of successful theme shop, <a href=\"http:\/\/restored316designs.com\/\" target=\"_blank\">Restored 316 Designs<\/a>, she&#8217;s also just launched <a href=\"http:\/\/pinkandpress.com\/\" target=\"_blank\">Pink &amp; Press<\/a>, a new feminine themes marketplace for WordPress.<\/p>\n<p>Already featuring themes from well known Genesis names, <a href=\"https:\/\/twitter.com\/OhHelloDesigns\" target=\"_blank\">Susan Nelson<\/a> and <a href=\"https:\/\/twitter.com\/thepixelista\" target=\"_blank\">Jessica Barnard<\/a>, she&#8217;s also looking for other top feminine theme designer \/ developers to get on board (something she talks more about below).<\/p>\n<p>Plus as well as a surprise announcement (you&#8217;ll have to read the interview!), she&#8217;s also generously giving away a Restored 316 Designs WordPress theme in our competition at the end of the interview.<\/p>\n<p>Let&#8217;s meet Lauren Gaige!<\/p>\n<hr \/>\n<p><strong>NICK: You’re probably most well known, at least in the Genesis community, for being the creative force behind all the beautiful themes over at Restored 316 but for those that maybe don’t know, tell us a little bit about yourself, where you live, what you do and what makes you tick?<\/strong><\/p>\n<p>LAUREN: Well, my name is Lauren Gaige and I live in Austin, TX where I’ve been for nearly 11 years. Before that, I lived in Houston TX where I met my husband of almost 11 years. We have two beautiful children.. our daughter is 8 and our son is 3.<\/p>\n<p>I’ve always been a lover of anything creative. You would either find me drawing, playing music, or taking photographs growing up. Creativity is what fuels me and with it, it truly drives me to help others.<\/p>\n<p>But more than creativity, my heart and passion are to inspire others to make their big God-sized dreams happen. That’s what makes me tick! It’s why I work hard every day to “make the internet beautiful one website at a time™” and encourage women that they can make those dreams a reality, and the start of that is a beautiful website design!<\/p>\n<p><strong>How did you first get into Genesis and how long have you been working with it?<\/strong><\/p>\n<p>I first discovered <a href=\"http:\/\/www.studiopress.com\/\" target=\"_blank\">StudioPress<\/a> with the launch of the original <a href=\"http:\/\/my.studiopress.com\/themes\/lifestyle\/\" target=\"_blank\">Lifestyle theme<\/a> and began designing custom sites with that. When Genesis was released I immediately jumped on board, although with some hesitation since it was learning a whole new way of coding, but have never looked back! So I’ve been working with Genesis now for over 5 years!<\/p>\n<p><strong>What are the biggest reasons to work in Genesis for you?<\/strong><\/p>\n<p>Since I’m a theme developer now, my biggest reasons are security, SEO, and updates. Not having to worry about going back through each of my child themes I release to make sure they stay up to date with latest security measures, SEO tools, etc is huge for me in running a business, and also for the user to know they can trust the team at <a href=\"http:\/\/rainmakerdigital.com\/\" target=\"_blank\">Rainmaker Digital<\/a> to keep their site all up to date while Restored 316 focuses on gorgeous designs!<\/p>\n<p><strong>Genesis 2.2 has just been released with a big focus on accessibility. What, if anything, would you like to see on the roadmap for future Genesis releases?<\/strong><\/p>\n<p>Because my market is predominantly women and do it yourselfers, most of them would really love to have more customization options such as font changes or widget flexibility. I would love to see these types of features added in the future to give the user a little more control of their own site.<\/p>\n<p><strong>I know that you enjoy photography, any other hidden talents or passions you’d like to share?<\/strong><\/p>\n<p>Hahaha! I’m obsessed with music and everyone around me says I can sing.. but I’m critical of myself in that department so I’ll stick to designing websites and taking pictures, and just sing in the shower! 😉<\/p>\n<p>Aside from that, I have a passion for inspiring women to fulfill their God-given dreams and helping them make it a reality! I was in their shoes when I started my business over 7 years ago and all I wanted was to have a business and be able to stay home with my children… I only want the same for other women like myself!<\/p>\n<p><strong>I could definitely ask you about 100 things about <a href=\"http:\/\/restored316designs.com\/\" target=\"_blank\">Restored 316<\/a> (and I encourage people to check it out if they haven’t seen it!) but given the timing of this article it seems most appropriate to ask you about your new project, <a href=\"http:\/\/pinkandpress.com\/\" target=\"_blank\">Pink &amp; Press<\/a> (‘a feminine WordPress theme marketplace’). For people that don’t know, what’s the backstory to it, what made you decide to do it and why now?<\/strong><\/p>\n<p>I have had this idea in my mind for well over a year and have even owned the domain for just as long. It’s something I’d talk about and dream about with my husband but would always second guess myself on whether or not it was all actually a good idea or that it was needed in the market. When creating something completely new and something that hasn’t been done before, it’s a little nerve wracking to put it all out there for everyone to see.<\/p>\n<p>Then a few months ago, I started seeing consistent emails from clients that had horrible experiences with other theme developers on places like Creative Market and Etsy and this idea immediately came up once again. With the influx in theme “developers” all over the internet now, I figured the time was probably right now to launch this project!<\/p>\n<p>Overall, Pink &amp; Press is there to bridge the gap for buyers AND developers to solve the issues that have been experienced in the market with the incredible growth of WordPress as a whole, and the developers wanting to be a part of it.<\/p>\n<p>From the feminine theme market standpoint, there is no universal place to buy trusted themes where you know the code is quality, the design is unique, and the support is there when you need it. Because there are no coding standards the seller has to adhere to, anyone can sell a theme on Etsy or Creative Market, and Pink &amp; Press is here to fill that void.<\/p>\n<p>So from a buyer standpoint, Pink &amp; Press is solving the problem of finding a trusted developer that has developed a well coded theme, and one that will provide the support to help get you up and going. I’ve heard way too many horror stories from people who have paid $50 for a theme only to discover they get no support, or the code is horrible, and then they have to start their search all over again having wasted $50 and countless hours of time. And coming from someone who only had $10 when I started my business, this type of business is absolutely unacceptable to me!<\/p>\n<p>From a developer standpoint, there are sooooo many talented Genesis theme developers out there that know their stuff, but have no time to dedicate to opening a theme shop because they don’t want to have to drive a ton of traffic to their own websites. Pink &amp; Press is that place they can create themes and put them for sale without having to spend a ton of time marketing and promoting their own themes. If you’re a Genesis developer and have a feminine style of design, we would love to have you!<\/p>\n<p><strong>I see that you already have two great developers (<a href=\"https:\/\/twitter.com\/OhHelloDesigns\" target=\"_blank\">Susan<\/a> at <a href=\"http:\/\/ohhellodesigns.com\/\" target=\"_blank\">Oh Hello Designs<\/a> and <a href=\"https:\/\/twitter.com\/thepixelista\" target=\"_blank\">Jessica<\/a> at <a href=\"http:\/\/thepixelista.com\/\" target=\"_blank\">The Pixelista<\/a>) on Pink &amp; Press and you’re looking to add more. Other than following the Pink &amp; Press Promise that you’ve published, do you have particular criteria in mind when deciding which developers you add next?<\/strong><\/p>\n<p>Sure! I’m looking for code that is well organized, someone who has been developing for quite a while, has some experience in the Genesis community, has a trusted background of taking care of their clients, and original theme designs&#8230; all with a feminine touch! I know that’s a mouth full, but these things are ALL so important to me!<\/p>\n<p><strong>How is your time split at the moment between Pink &amp; Press, <a href=\"http:\/\/www.cuptakes.com\/\" target=\"_blank\">Cuptakes<\/a> (your iPhone app \/ case business) and Restored 316? Do you plan shift more of your time to Pink &amp; Press if things go well (in terms of maybe doing more marketing etc) or do you see it strictly as a side project?<\/strong><\/p>\n<p>This is a great question that I get asked a lot. Many people think I do it all, but what you don’t know is I have lots of help! My husband is the guy behind Cuptakes and he manages everything involving that business&#8230; cases sold through the site, case manufacturing, emails, social media, designing, and updates for the app. I did do monthly designs for Cuptakes up until recently when we realized I simply didn’t have the time to do all the designs anymore, so there are some changes going on behind the scenes with the app and we are looking into having some contributing designers to add designs along with designs from me from time to time!<\/p>\n<p>At Restored 316, I have two amazing employees that rock! <a href=\"http:\/\/www.courtneykirkland.net\/\" target=\"_blank\">Courtney Kirkland<\/a> is my assistant and she handles all the nitty gritty stuff of my business so that I can actually work ON my business instead of always IN it. She’s my email rockstar answering the bajillion emails that come through every day. I also have <a href=\"http:\/\/ebizelephant.com\/\" target=\"_blank\">Stephanie Hellwig<\/a> on our support desk answering all those questions and helping get the theme set up and beautiful like our demo sites!<\/p>\n<p>As for Pink &amp; Press, my husband is also handling all the behind the scenes task with this business! I’ve realized my gift is design and development and to let others take on the task they are good at. My husband is very analytical and is a great writer, so he’s great at answering emails and handling the legalities that come with the Pink &amp; Press business model! I’d say we are a great team 😉<\/p>\n<p><strong>Have you set goals for the project (financial or otherwise)?<\/strong><\/p>\n<p>Yes and no. At first I just launched this project apprehensively because I wasn’t sure how it would be received in the market. However, after it’s launch, I’m seeing more than ever that it is so needed and have gotten a lot of amazing feedback through email and social media. So I have a short term sales goal and we will see how it goes! I’ll say I’m a huge goal setter and am an absolutely determined person, so I have no doubts that we will get there way sooner than I even expect us to!<\/p>\n<p><strong>Have you given much thought about how you’ll distinguish what you’re doing from other Genesis \/ WordPress theme marketplaces? If so, how do you plan to do so?<\/strong><\/p>\n<p>The main differentiating factor between Pink &amp; Press and other marketplaces is that we will only offer Feminine style designs. The feminine theme market is absolutely there, as I’ve seen in the incredible success of Restored 316, so I think having a place specifically dedicated to that market is needed.<\/p>\n<p>It’s also a place that buyers can come and know they can TRUST the developer. This is backed up by the Pink &amp; Press Promise that assures each customer that their theme meets our quality standards.<\/p>\n<p><strong>What do you think of the current state of the Genesis theme market and where do you see it headed?<\/strong><\/p>\n<p>As for the current state, I see it as an incredible success. Again, I’ve been blown away by the amount of business we get at Restored 316, and it’s really opened my eyes to the Genesis theme market and how much it’s needed…. especially in the feminine style arena.<\/p>\n<p>As for the future, I see future designs starting to be geared firstly for mobile devices. With the increase in stats of people viewing sites strictly on their mobile device, I think theme design for mobile will just continue to get better and better so you can have a beautiful website from the computer screen all the way down to the smallest mobile device.<\/p>\n<p><strong>What are your thoughts at the moment on marketing Pink &amp; Press and who do you expect your typical customer to be (e.g. fellow developers, ‘regular’ website users, a particular niche etc.)?<\/strong><\/p>\n<p>Well, I think the market for Pink &amp; Press buyers is exactly the same people I attract over at Restored 316. Women who are wanting to start a business or blog, bloggers who want a new design, and developers designing these types of sites for their clients!<\/p>\n<p><strong>Are there any other WordPress businesses you particularly look up to, either inside or outside of the Genesis community to copy get inspiration from (and why)?<\/strong><\/p>\n<p><a href=\"http:\/\/www.emilyley.com\/\" target=\"_blank\">Emily Ley<\/a>! I love her as a person and that she is real and authentic with her audience. I think her buyers connect with her story and therefore connect with her brand (which is gorgeous anyways!) and we can all learn a thing or two from that nowadays with the growth of social media. I want to personify an authentic brand and I want my passion for what I do to shine through the computer screen just as Emily has done with her business.<\/p>\n<p><strong>Finally, any other ‘never before revealed ‘information about Pink &amp; Press that you’d like to share with GenesisWP.guide readers? 🙂<\/strong><\/p>\n<p>We will be launching an affiliate program VERY soon, so be sure to come over and subscribe to the newsletter to be the first to know about that!!<\/p>\n<p><strong>What’s the best way for people to get in touch with you if they want to learn more about what you do?<\/strong><\/p>\n<p>I’m obsessed with <a href=\"https:\/\/instagram.com\/restored316\/\" target=\"_blank\">Instagram<\/a>, so you can always leave me a message there or shoot me an email directly at lauren@restored316.com<\/p>\n<p><strong>And finally the most important question of all, Game of Thrones or Downton Abbey?<\/strong><\/p>\n<p>Oh hands down… Downton Abbey!! So disappointed I can’t watch it with all the British people right now!<\/p>\n<hr \/>\n<p>Thanks so much to Lauren for taking the time to answer so many questions.<\/p>\n<p>If you haven&#8217;t already, make sure you check out <a href=\"http:\/\/restored316designs.com\/\" target=\"_blank\">Restored 316 Designs<\/a> and of course her latest project <a href=\"http:\/\/pinkandpress.com\/\" target=\"_blank\">Pink &amp; Press<\/a>.<\/p>\n<p>I&#8217;ll be back soon with another interview with another awesome Genesis creator.<\/p>\n<hr \/>\n<h2 id=\"giveaway\" style=\"text-align: center;\">Win a theme from Restored 316 Designs!<\/h2>\n<p style=\"text-align: center;\"><strong>For your chance of winning a <a href=\"http:\/\/restored316designs.com\/themes\/\" target=\"_blank\">your choice of theme of your choice from Restored 316 Designs<\/a> just enter your name and email address below.<\/strong><br \/>\n<em>(Competition closes 11:59pm PST, Sunday 27 September 2015)<\/em><\/p>\n<p style=\"text-align: center;\"><p>This giveaway has now finished *sad face*, but look out for new chances to win cool stuff in future articles *happy clap*.<\/p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Lauren Gaige on her new WordPress theme marketplace, Pink &#038; Press; how you can get involved; plus, win a Restored 316 Designs theme.<\/p>\n","protected":false},"author":2,"featured_media":213,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[16],"tags":[],"jetpack_featured_media_url":"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/09\/lauren.jpg","yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Lauren Gaige on her new WordPress theme marketplace, Pink &amp; Press; how you can get involved; plus, win a Restored 316 Designs theme.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/genesiswp.guide\/meet-lauren-gaige\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Meet Lauren Gaige (and win a Genesis theme!)\" \/>\n<meta property=\"og:description\" content=\"Lauren Gaige on her new WordPress theme marketplace, Pink &amp; Press; how you can get involved; plus, win a Restored 316 Designs theme.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/genesiswp.guide\/meet-lauren-gaige\/\" \/>\n<meta property=\"og:site_name\" content=\"GenesisWP.guide\" \/>\n<meta property=\"article:published_time\" content=\"2015-09-21T12:30:38+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-09-21T12:27:03+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/09\/lauren.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"660\" \/>\n\t<meta property=\"og:image:height\" content=\"440\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/genesiswp.guide\/#website\",\"url\":\"https:\/\/genesiswp.guide\/\",\"name\":\"GenesisWP.guide\",\"description\":\"The best new WordPress Genesis things\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/genesiswp.guide\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/genesiswp.guide\/meet-lauren-gaige\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/09\/lauren.jpg\",\"width\":660,\"height\":440,\"caption\":\"Lauren Gaige\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/genesiswp.guide\/meet-lauren-gaige\/#webpage\",\"url\":\"https:\/\/genesiswp.guide\/meet-lauren-gaige\/\",\"name\":\"Meet Lauren Gaige (and win a Genesis theme!) - GenesisWP.guide\",\"isPartOf\":{\"@id\":\"https:\/\/genesiswp.guide\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/genesiswp.guide\/meet-lauren-gaige\/#primaryimage\"},\"datePublished\":\"2015-09-21T12:30:38+00:00\",\"dateModified\":\"2015-09-21T12:27:03+00:00\",\"author\":{\"@id\":\"https:\/\/genesiswp.guide\/#\/schema\/person\/b5cc53502a0c6971db47f22c6d57babb\"},\"description\":\"Lauren Gaige on her new WordPress theme marketplace, Pink & Press; how you can get involved; plus, win a Restored 316 Designs theme.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/genesiswp.guide\/meet-lauren-gaige\/\"]}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/genesiswp.guide\/#\/schema\/person\/b5cc53502a0c6971db47f22c6d57babb\",\"name\":\"Nick Davis\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/genesiswp.guide\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/015e3d0d2b959afa2ce18901b2d64ab2?s=96&d=mm&r=g\",\"caption\":\"Nick Davis\"},\"description\":\"Nick has been playing with websites since 1997, WordPress since 2010 and still hasn't broken the Internet. Tweet him up at @iamnickdavis.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts\/209"}],"collection":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/comments?post=209"}],"version-history":[{"count":0,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts\/209\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/media\/213"}],"wp:attachment":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/media?parent=209"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/categories?post=209"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/tags?post=209"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}