{"id":392,"date":"2016-04-18T11:45:32","date_gmt":"2016-04-18T09:45:32","guid":{"rendered":"http:\/\/genesiswp.guide\/?p=392"},"modified":"2016-04-18T15:04:39","modified_gmt":"2016-04-18T13:04:39","slug":"meet-tonya-mork","status":"publish","type":"post","link":"https:\/\/genesiswp.guide\/meet-tonya-mork\/","title":{"rendered":"Meet Tonya Mork (and win a year of Know The Code!)"},"content":{"rendered":"<div id=\"fb-root\"><\/div>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-393\" src=\"http:\/\/genesiswp.guide\/wp-content\/uploads\/2016\/04\/tonya-cropped.jpg\" alt=\"Tonya Mork\" width=\"660\" height=\"440\" srcset=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2016\/04\/tonya-cropped.jpg 660w, https:\/\/genesiswp.guide\/wp-content\/uploads\/2016\/04\/tonya-cropped-300x200.jpg 300w\" sizes=\"(max-width: 660px) 100vw, 660px\" \/><\/p>\n<p><strong>In a shift from our regularly scheduled programming, today I&#8217;m delighted to share an interview with one of the Genesis&#8217; communities finest, <a href=\"http:\/\/twitter.com\/hellofromtonya\" target=\"_blank\">Tonya Mork<\/a> of <a href=\"https:\/\/knowthecode.io\/\" target=\"_blank\">Know The Code<\/a>.<\/strong><\/p>\n<p>Know The Code is a new membership site designed to teach you how to be a developer (particularly a WordPress developer) from the ground up.<\/p>\n<p>Of course it&#8217;s not the only online resource out there for learning WordPress but with it&#8217;s slightly different approach &#8211; and it&#8217;s focus on Genesis in particular (in fact, this month is Genesis Framework month on Know The Code) &#8211; I wanted to hear more.<\/p>\n<p>She&#8217;s also generously sharing an exclusive discount code for Know The Code for GenesisWP.guide readers and doing a giveaway for a year&#8217;s membership to the site at the end of this interview.<\/p>\n<p>I hope you enjoy.<\/p>\n<hr \/>\n<p><b>NICK: For those that don’t know, tell us a little bit about yourself, where do you live, what do you do and what makes you tick?<\/b><\/p>\n<p>TONYA: Hello, I’m Tonya.  I’m a happy-go-lucky gal who happens to be a software teacher, electrical engineer, and software engineer.  I live in the states in a quiet, small fishing village on Lake Michigan in NE Wisconsin.<\/p>\n<p>What makes me tick is kindness and helping.  It comes in the smallest gestures of making someone laugh, holding a door for them, helping our neighbors, or sharing what I know to help here in this software community.<\/p>\n<p>Things that I like are acid jazz, hot lemon water, baseball, and glorious sceneries.<\/p>\n<p>What do I do? I share what I know to help web developers better themselves by teaching them how to evaluate and build clean, quality code…from scratch.<\/p>\n<p><b>You recently did a (fantastic) <a href=\"http:\/\/heropress.com\/essays\/finding-your-purpose-in-life\/\" target=\"_blank\">interview with HeroPress on Finding Your Purpose In Life<\/a> in which you explained some of the health challenges you’ve faced. Without wanting to make you repeat everything you already said there(!), for those that didn’t read the interview yet (and I encourage everyone to read that too) can you tell us a little more about what you went through and how it eventually led you to WordPress?<\/b><\/p>\n<p>I used to build mega-million dollar high-tech systems for the major manufacturers in the world. But then my health failed and threw me into isolation, as I struggled everyday to survive.<\/p>\n<p>During this period, I was lost. I started dabbling in WordPress for a non-profit and blog I started. It ignited my engineering self.  I wanted to really know it; so I dug into the core code to reverse engineer it.  Then I found the WordPress Community, which gave me purpose again.<\/p>\n<p>I received a miracle (<a href=\"http:\/\/heropress.com\/essays\/finding-your-purpose-in-life\/\" target=\"_blank\">go read my essay on HeroPress for the details<\/a>). In that moment, I was changed forever. In this third chapter of my life, I just want to dedicate myself to teaching and helping.<\/p>\n<p><b>After getting into WordPress, how did you first get into Genesis and how long have you been working with it?<\/b><\/p>\n<p>I found Genesis in the either late 2010 or early 2011.  I believe in focusing your time and energies on those things that are unique and custom.<\/p>\n<p>I had a choice of writing my own theme or using something in the market.  Writing my own meant I had to invest my time to write and test it.  Then over the years I’d have to maintain it.  That didn’t appeal to me. Why? Because it is too costly.<\/p>\n<p>Every website has custom features and components.  These unique bits are why a client comes to you.  That is where you do your work and make your money.<\/p>\n<p>In a theme, there is a huge amount of redundancy from site-to-site.  Genesis takes care of that for you, giving you a solid platform from which to do the custom bits.  It enables you to spend your time and efforts wisely.  You are not having to maintain the entire theme or adjusting it for SEO, WordPress, security, microdata, or HTML markup changes. No, you just maintain your custom bits.<\/p>\n<p><b>I think I first came across your work, in a major way at least, last year when you were <a href=\"http:\/\/officehours.fm\/podcast\/72-2\/\" target=\"_blank\">chatting to Carrie on OfficeHours.fm<\/a>. It was just around the time you were rolling out the <a href=\"http:\/\/wpdevelopersclub.com\/\" target=\"_blank\">WP Developers Club<\/a> (and I know you put together a pretty awesome team of advisors for that) and and now you’ve launched another new project, called <a href=\"http:\/\/knowthecode.io\/\" target=\"_blank\">Know The Code<\/a>. For those that don’t know can you tell us a little more about those projects, how they came about and how they’re related (if at all!). From the outside looking in it seems like Know The Code is now your main focus?<\/b><\/p>\n<p>WP Developers Club was in the works for about two years before it launched.  I had the idea of creating a club just for WordPress developers.  In engineering, we have clubs and associations such as <a href=\"http:\/\/www.ieee.org\/\">IEEE<\/a> and <a href=\"http:\/\/societyofwomenengineers.swe.org\/\">Society of Women Engineers<\/a>, which provide education and services for their members.  I wanted that for our community.<\/p>\n<p>We started down a path of creating a formal school and apprenticeship program.  But then we discovered that the market wasn’t as supportive of these educational programs,, due to the amount of time a person would need to invest to level up through it.  The time and effort it would take to build these far outweighed the support.  We had to rethink and make adjustments.<\/p>\n<p>I turned WP Developers Club into a community, where you can join our Slack group and help one another.<\/p>\n<p>But I still wanted to teach and help our community to redirect their time away from  “searching for code and solutions” to building it themselves. I wanted to help each person to be capable of sitting down, putting his\/her hands on the keyboard, and just writing the code from scratch.  No more spending hours searching for how to do something. No more relying on bloated plugins to provide the features you need.  I wanted to help each developer be able to maximize his\/her time and have the confidence and ability to build anything.<\/p>\n<p>So I took the educational component of WP Developers Club and shaped it into <a href=\"https:\/\/knowthecode.io\">Know the Code<\/a>.<\/p>\n<p>Yes, I spend the majority of my time focusing on <a href=\"https:\/\/knowthecode.io\">KnowTheCode.io<\/a> now.  As I release content nearly every day, my days are filled with planning out materials, recording, editing, releasing, and helping in the Pro forums.  But I do spend time too in the WP Developers Club community answering questions and talking with fellow developers.<\/p>\n<p><b>How’s it gone with Know The Code, so far? Any surprises (good or bad) or stories you can share?<\/b><\/p>\n<p>The response from those who have signed up is incredible.  I’m completely humbled by the by the response from the members who give me a chance to help them.  People are so kind to share how it’s helping them and filling in those gaps.<\/p>\n<p>I had one member who asked what one of the quips had to do with the PHP <a href=\"https:\/\/knowthecode.io\/doc\/foreach\">foreach<\/a> in the Docx that he was reviewing.  The quips are these silly, witty phrases that we embedded into the middle of the articles to break up the content.  Code is meant to be fun.  I wanted to inject a bit of humor to make you laugh.<\/p>\n<p>Another person asked me why I leave some the errors and whoops in the videos.  I want it to feel like you and I are sitting together working on code.  In normal workflow, there will be some boo boos and backtracking as you are thinking through the code and problem.  The videos are lightly edited to make them more real, i.e. more of unplugged, real world feeling to them.  I don’t like over-produced showmanship, as it detracts from the code and learning.<\/p>\n<p>Shoot, sometimes I’ll laugh and say, “Well I messed that up. I bet you caught that and are laughing at me.” It makes it more real.  I like that.<\/p>\n<p><b>A lot of your focus with Know The Code, particularly this month with your Genesis Framework month, is on Genesis. Obviously we’re big fans of Genesis here at GenesisWP.guide but what are the biggest reasons to work in Genesis for you and why did you decide to make it a core part of what Know The Code teaches?<\/b><\/p>\n<p>I teach PHP, WordPress, Genesis, JavaScript, and jQuery.  I selected Genesis as one of my focal core technologies because, in my opinion, it is a developer’s theming framework.<\/p>\n<p>I talked about why I use Genesis early.  As developers, we have to focus ourselves and our limited time on the custom bits.  You don’t have time to write a theme from scratch for every project.  There are far too many features and custom elements to each project.  Just the styling alone is very time consuming.  Genesis abstracts away the theming stuff and lets you do what professional developers do: write the custom bits.<\/p>\n<p>I use it because I can customize anything in it easily and with minimal effort.  I want to share that with you. I want you to maximize your talents and gifts.  I want you to focus on the money making bits of your projects.  Genesis helps you to do this.<\/p>\n<p><b>You’re currently in the middle of Genesis Framework month, what other plans do you have for that and Genesis education in general?<\/b><\/p>\n<p>This month I’m focusing on Genesis to <i>kick off<\/i> the theming component of web development and to begin building the knowledge libraries.  It’s only a drop in the bucket of what will come.<\/p>\n<p>I will be thoroughly documenting (<a href=\"https:\/\/knowthecode.io\/the-docx\">Docx<\/a>) each and every construct, even, constant, and data type for the technologies (PHP, WordPress, Genesis, JavaScript, and jQuery).  These Docx will take time.  I build them incrementally to support the hands-on building <a href=\"https:\/\/knowthecode.io\/labs\">Labs<\/a>.<\/p>\n<p>As a WordPress developer, even if you specialize in Genesis-powered sites, you must have a solid foundation in PHP, HTML, CSS, and WordPress Core.  It all works together.  Then you can get the most out of Genesis.<\/p>\n<p>For Genesis specifically, I will continue building the Developer’s Guide to Customizing Genesis, as there are many more components to add to it.  Then I’ll be doing various Bootcamps and one-specific feature labs for you.<\/p>\n<p>Over the months and years, you will get to build a lot of code, some of it will be feature-based plugins while others will be front-end presentation in a child theme.  It’s code. Therefore, the possibilities are endless on what we can build together.<\/p>\n<p><b>After Genesis Framework month, what’s the next focus?<\/b><\/p>\n<p>Well in May I’m starting a bootcamp series for the absolute beginner to teach them the core fundamentals of web development and programming.  I have an Object-Oriented Programming (OOP) Bootcamp that I’m working on which I’m not sure yet when I’ll fully release it.<\/p>\n<p>I’ve barely scratched the surface of Genesis, WordPress, and PHP.  I’ll continue building up the libraries for each of these technologies.  Remember that Genesis runs on WordPress which runs on PHP.  You have to have a solid proficiency in PHP first in order to build anything from scratch.  OK, no problem, you’ll get that here.<\/p>\n<p>Then in the summer, I’ll start working on jQuery and JavaScript.<\/p>\n<p><b>What do you think of the current state of the WordPress education market in general?<\/b><\/p>\n<p>I started Know the Code because I couldn’t find an online source in this ecosystem which focused on building adaptable, fundamental skills.  Everything focuses on a single edge case. Education in our space is focused on “showing.”<\/p>\n<p>The “showing” model creates a copy\/paste mentality.  You go and watch a video.  For that one thing they are showing you, you can take the code and paste that into your project.<\/p>\n<p>But are you able to turn that code into something else, some other feature? Did they thoroughly explain the thought process of why the code is constructing in this way, how it works, or what other alternatives are possible? Did they talk about potential side effects? If there’s a bug in that code or some side effect that conflicts with something else, did you get the skills from the educational source to properly troubleshoot that code?<\/p>\n<p>Being self-taught typically means you learned little bits of information when you needed for a specific task you were doing.  That creates these gaps, where something may work, but you don’t understand why.  Plus you may have hidden bugs that cause the viewers or your client problems or nuisancy issues.<\/p>\n<p>For example, the Event Registry system in WordPress’ Plugin API is a huge part of what we do, as it allows us to customize WordPress, Genesis, and other plugins.  But do you really understand what an `<a href=\"https:\/\/knowthecode.io\/docx\/wordpress\/add_action\">add_action<\/a>` or `<a href=\"https:\/\/knowthecode.io\/docx\/wordpress\/add_filter\">add_filter<\/a>` does?  I see a lot of questions on problems with callbacks, arguments, and priority levels.<\/p>\n<p>The fundamentals are so important to fill in these gaps.<\/p>\n<p>Let me give you an example that might be relatable.  This weekend I was with my in-laws.  The family is very musical.  My niece was teaching me how to play a small scale in this song on the piano.  I don’t know how to play the piano.  But I copied what she told me to do.  I was able to get the notes out of the piano.  So it sounds like I could play.  But I can’t play any other part of the song, read music, or play any other song.  I just copied what she showed me.  I didn’t learn adaptable skills.<\/p>\n<p>Other educational and tutorial resources are valuable.  Don’t get me wrong.  If you have a solid baseline knowledge and know the code, then you can really get a lot of these other sites for those specific edge cases and features.  You’ll know how to take what they are <i>showing<\/i> you and alter it for your specific needs.<\/p>\n<p><b>Of course, there’s a reasonable amount of WordPress and Genesis courses out there already (though I think the market is far from saturated). For Genesis, I’m thinking of Carrie Dils over at Lynda and Sridhar’s own membership site particularly &#8211; have you given much thought about how you’ll distinguish what you’re doing from other offerings or how Know The Code complements them? If so, how do you plan to do so?<\/b><\/p>\n<p>Absolutely. Know the Code is very different.<\/p>\n<p>Those sites are focused on a specific edge case.  When you need a specific feature to add to your website, such changing the top navigation bar when scrolling down the page, these sites are awesome for that.  Sridhar, for example, provides creative tutorials for you to add cool features to your site.  Carrie teaches basic theming in Genesis.  These resources help you to see code and site design in different ways.<\/p>\n<p>But they do not teach you the true essence of code, code construction, clean, quality code techniques, root cause analysis, or how to think logically and solve problems.  They do not empower you to take what you learn and expand it in real-world, professional programming and development skills.<\/p>\n<p>I’m teaching you how to not only work in Genesis or WordPress, but in any web development profession. Code is code.  Once you learn how to think about code, you can get that computer to do what you want it to do.<\/p>\n<p>Isn’t that what you want? Don’t you want to quote a project and know that “Yes, this is the way to do it and I know how, on my own?”  Don’t you want to be able to just sit down, know exactly what you are doing, and just let the code flow out of you into the keyboard?  That’s what I teach.<\/p>\n<p>I think the current resources are valuable and we complement one another.  But what I do is very different.  While yes, I will give you something pretty to build or some cool feature to add to your project.  But those specific one feature edge cases are a cover to teach you true programming and web development.<\/p>\n<p>I want you to be able to own that title “Web Developer” and have it mean something not only in WordPress but in any market or technology.  I’m teaching you this profession and craft.<\/p>\n<p>I think that distinguishes Know the Code and me.  I’m here to serve a different purpose.<\/p>\n<p><b>Are there any other WordPress businesses you particularly look up to, either inside or outside of the Genesis community to <\/b><b>copy<\/b><b> get inspiration from (and why)?<\/b><\/p>\n<p>I’m very drawn to people and businesses who live <i>integrity<\/i>. It is who they are. They are about helping you to be more awesome.  They know that community-first and value-first approach helps for the betterment of the entire ecosystem.  They do not employ the sizzle, flash, or over-the-top salesy stuff.  You don’t feel pressured or icky when you visit their sites or read their stuff.  No, you get insightful information and real value.<\/p>\n<p>Integrity. Character. Value. Quality. Focusing on your core strengths. Solving a real problem. Being there with real customer support. These are attributes which catch my eye and draw me to their services, products, and websites.  They go above and beyond to give you, not only a quality product or service, but to support you.<\/p>\n<p>I’m inspired by this approach and philosophy because it’s good for the entire ecosystem and the individual. Then when you need what they are offering, you go directly to them because they are the authority and you trust them. You know they will deliver and help you.<\/p>\n<p>Our community is filled with such companies and people.  It’s a huge reason why I stay here.  People have integrity here.  They want to help one another.<\/p>\n<p>More specifically, I’m a big fan of <a href=\"http:\/\/wpninjas.com\/\" target=\"_blank\">WP Ninjas<\/a>, <a href=\"http:\/\/www.studiopress.com\/\" target=\"_blank\">StudioPress<\/a>, <a href=\"https:\/\/serverpress.com\/\" target=\"_blank\">ServerPress<\/a>, <a href=\"https:\/\/pippinsplugins.com\/\" target=\"_blank\">Pippins Plugins<\/a>, and many others.  These companies stay true to their niche and fulfill a need in the marketplace with quality products and excellent support.  They give of themselves to help you.  You buy from them, not only because their services and products are awesome, but because you believe in them.  You know they have your back and are there for you.<\/p>\n<p>On the people side, <a href=\"https:\/\/twitter.com\/tommcfarlin\" target=\"_blank\">Tom McFarlin<\/a>, <a href=\"https:\/\/twitter.com\/cdils\" target=\"_blank\">Carrie Dils<\/a>, <a href=\"https:\/\/twitter.com\/jameslaws\" target=\"_blank\">James Laws<\/a>, <a href=\"https:\/\/twitter.com\/MarcBenzak\" target=\"_blank\">Marc Benzakein<\/a>, <a href=\"https:\/\/twitter.com\/jdelia\" target=\"_blank\">Jackie D’Elia<\/a>, <a href=\"https:\/\/twitter.com\/schlessera\" target=\"_blank\">Alain Schlesser<\/a>, and <a href=\"https:\/\/twitter.com\/GaryJ\" target=\"_blank\">Gary Jones<\/a> are some of my favorite people. They have integrity and go the extra mile to reach out and give of themselves.  They truly want to help you fulfill your potential.<\/p>\n<p>Outside of WordPress, I really like what Jeffrey Way did at <a href=\"http:\/\/laracasts.com\">Laracasts<\/a> as well as Ryan Bates at <a href=\"http:\/\/railscasts.com\/\">RailsCasts<\/a>.  I was with both of them when each launched.  They give a ton of value to each web developer.  Jeffrey nails it with clean, quality code and proper testing methodologies.<\/p>\n<p><b>Have you set targets for Know The Code (financial or otherwise)? Is there a point you have in mind where you’d consider it a ‘success’?<\/b><\/p>\n<p>Of course I have.  I keep a close eye on the financials as any business owner does.  I have metrics in place and have set milestones to let me know if the community wants me to teach them or not.<\/p>\n<p>As I said in my essay, I’m not interested in acquiring stuff.  I’m not interested in building a big company or lining my pockets.  That has no value for me.  I just need enough of an income to support my family.  I need enough income to allow me to dedicate myself to helping you.<\/p>\n<p>I’m talking with some companies to become sponsoring partners, companies that I believe in. I’m asking help me fulfill my mission and be here for you. Their backing and support will definitely help me to stay right here and help you.<\/p>\n<p>Will Know the Code provide enough income so that I can do just this and nothing else? Well, that’s up to all of you and the WordPress developers’ community to determine if I am providing you with value to be a better programmer and developer.<\/p>\n<p>Do I have a point where I would consider it a success? I think success will be measured in the success of each developer. As I’m here to help developers, it’s not my success that matters, but rather each person and the results they get through my teachings.<\/p>\n<p><b>Having launched now, what’s the one piece of advice you’d give to other creators in the WordPress space that are thinking of launching their own projects?<\/b><\/p>\n<p>Do what you know and are passionate about.  Find a way to take that thing which is uniquely yours and match it up with a problem that others are having.  Solving a problem in a unique way helps to differentiate you from others.  And then deliver it with integrity and value.<\/p>\n<p><b>Away from business, what are the biggest improvements, if any, you’d like to see in WordPress core and the Genesis Framework?<\/b><\/p>\n<p>As a software community, the biggest improvement we can make is to level up each developer, fill in those technical gaps, and ensure each person knows the fundamentals of computation and programming.  Once we do this, we will innovate and continue to propel WordPress into the future.<\/p>\n<p>Software and digital computing makes huge leaps and bounds each and every year.  It’s our job to keep pace and ensure WordPress and Genesis are not getting left behind.  I want you to prosper and be in this profession for years to come.  It all starts with a solid foundation.  And then in this profession, continuous, relentless learning is an absolute must.<\/p>\n<p>Listen to me. Code is code. You combine the building blocks together in a clean, quality manner.  It allows you to build a small ma\/pa website to powering up financial centers, robotics, and predictive monitoring systems.  It starts with knowing the building blocks, practical clean, quality code techniques, and testing practices.  Knowing how to think about code, getting the most out of the computer, logical thought, problem solving, and code construction are what determine your ability to future-proof yourself in this business.<\/p>\n<p>More specifically for the software itself, I’d like to see more attention to clean code in Core.  In both WordPress and Genesis, I’d like to see us handle legacy systems differently to remove the bloat and baggage of old, out-of-date technologies.<\/p>\n<p>For WordPress Core, I’d like to see more emphasis on modularity to allow us the ability to decouple components and spin up only what we need.<\/p>\n<p><b>Any other hidden talents or passions you’d like to share?<\/b><\/p>\n<p>I’m passionate about saving animals who are unwanted.  We’ve filled our home over the decades with many loving furbabies.  Eddie, the Min Pin in my picture, is a Puppy Mill rescue. He’s a biter to anyone other than us.  But to us, he’s the biggest baby, who is almost always curled up on my lap.  We have two other kitties who were strays and starving. Now they live their lives watching the birdies in a home filled with love.<\/p>\n<p>I love writing and drawing.  In my younger days I was an avid sportswoman in basketball, software, and volleyball.<\/p>\n<p><b>Game of Thrones or Downton Abbey?<\/b><\/p>\n<p>Neither.<\/p>\n<p>Ha, you know I’ve been around a long time.  I remember sitting in the theatre for the opening of the first Star Wars in 1977.  My friends and I sat in the front row and loved every minute of it!<\/p>\n<p>Along the way and over the decades, I lost my zeal for sci fi. I really enjoy shows and movies that make me think about the strategy and intent. I watch a lot of documentaries and strategy-based shows, such as Elementary, Madam Secretary, and Enemy of the State.<\/p>\n<p><b>What’s the best way for people to get in touch with you if they want to learn more?<\/b><\/p>\n<p>I’m very accessible.  You can reach me on Twitter at <a href=\"https:\/\/twitter.com\/hellofromTonya\">@hellofromtonya<\/a>, forums or contact on <a href=\"https:\/\/knowthecode.io\">KnowTheCode.io<\/a>, or in multiple slack groups including GenesisWP, WP Developers Club, and Post Status.<\/p>\n<hr \/>\n<h2 id=\"giveaway\" style=\"text-align: center;\">Discount code and your chance to win!<\/h2>\n<p style=\"text-align: center;\">If you&#8217;re keen to try Know The Code, Tonya is generously sharing the following exclusive discount code for GenesisWP.guide readers to get 20% off a yearly Pro Membership on checkout for a limited time:<\/p>\n<p style=\"text-align: center;\"><strong>GENESISWPGUIDE<\/strong><\/p>\n<p style=\"text-align: center;\">(And don&#8217;t be put off using the discount code right away, if you win the giveaway and you&#8217;re already a yearly pro member, Tonya will refund your fee!).<\/p>\n<p style=\"text-align: center;\"><strong>For your chance of winning a <a href=\"https:\/\/knowthecode.io\/\" target=\"_blank\">1 year Pro Membership of Know The Code (worth $290)<\/a>, just enter your details below.<\/strong><\/p>\n<p style=\"text-align: center;\"><em>(Competition closes 11:59pm PST, Sunday 24 April 2016)<\/em><\/p>\n<p style=\"text-align: center;\"><p>This giveaway has now finished *sad face*, but look out for new chances to win cool stuff in future articles *happy clap*.<\/p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tonya Mork on Know The Code, who she looks up to in WordPress, and helping developers grow beyond a copy\/paste mentality.<\/p>\n","protected":false},"author":2,"featured_media":393,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[16],"tags":[],"jetpack_featured_media_url":"https:\/\/genesiswp.guide\/wp-content\/uploads\/2016\/04\/tonya-cropped.jpg","yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/genesiswp.guide\/meet-tonya-mork\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Meet Tonya Mork (and win a year of Know The Code!)\" \/>\n<meta property=\"og:description\" content=\"Tonya Mork on Know The Code, who she looks up to in WordPress, and helping developers grow beyond a copy\/paste mentality.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/genesiswp.guide\/meet-tonya-mork\/\" \/>\n<meta property=\"og:site_name\" content=\"GenesisWP.guide\" \/>\n<meta property=\"article:published_time\" content=\"2016-04-18T09:45:32+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2016-04-18T13:04:39+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2016\/04\/tonya-cropped.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"660\" \/>\n\t<meta property=\"og:image:height\" content=\"440\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/genesiswp.guide\/#website\",\"url\":\"https:\/\/genesiswp.guide\/\",\"name\":\"GenesisWP.guide\",\"description\":\"The best new WordPress Genesis things\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/genesiswp.guide\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/genesiswp.guide\/meet-tonya-mork\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2016\/04\/tonya-cropped.jpg\",\"width\":660,\"height\":440,\"caption\":\"Tonya Mork\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/genesiswp.guide\/meet-tonya-mork\/#webpage\",\"url\":\"https:\/\/genesiswp.guide\/meet-tonya-mork\/\",\"name\":\"Meet Tonya Mork (and win a year of Know The Code!) - GenesisWP.guide\",\"isPartOf\":{\"@id\":\"https:\/\/genesiswp.guide\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/genesiswp.guide\/meet-tonya-mork\/#primaryimage\"},\"datePublished\":\"2016-04-18T09:45:32+00:00\",\"dateModified\":\"2016-04-18T13:04:39+00:00\",\"author\":{\"@id\":\"https:\/\/genesiswp.guide\/#\/schema\/person\/b5cc53502a0c6971db47f22c6d57babb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/genesiswp.guide\/meet-tonya-mork\/\"]}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/genesiswp.guide\/#\/schema\/person\/b5cc53502a0c6971db47f22c6d57babb\",\"name\":\"Nick Davis\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/genesiswp.guide\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/015e3d0d2b959afa2ce18901b2d64ab2?s=96&d=mm&r=g\",\"caption\":\"Nick Davis\"},\"description\":\"Nick has been playing with websites since 1997, WordPress since 2010 and still hasn't broken the Internet. Tweet him up at @iamnickdavis.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts\/392"}],"collection":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/comments?post=392"}],"version-history":[{"count":0,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts\/392\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/media\/393"}],"wp:attachment":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/media?parent=392"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/categories?post=392"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/tags?post=392"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}
