{"id":98,"date":"2015-05-06T14:55:45","date_gmt":"2015-05-06T12:55:45","guid":{"rendered":"http:\/\/genesiswp.guide\/?p=98"},"modified":"2015-05-12T00:34:54","modified_gmt":"2015-05-11T22:34:54","slug":"calvin-makes-interview","status":"publish","type":"post","link":"https:\/\/genesiswp.guide\/calvin-makes-interview\/","title":{"rendered":"An interview with Calvin Makes (plus win Genesis themes)"},"content":{"rendered":"<div id=\"fb-root\"><\/div>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-100\" src=\"http:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/calvin-makes.jpg\" alt=\"Calvin Makes\" width=\"660\" height=\"440\" srcset=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/calvin-makes.jpg 660w, https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/calvin-makes-300x200.jpg 300w\" sizes=\"(max-width: 660px) 100vw, 660px\" \/><\/p>\n<p><em>This is the first in a new, weekly series of interviews on GenesisWP.guide, I&#8217;ve creatively called <strong>&#8216;Meet the Makers&#8217;<\/strong>. Featuring some of the finest creators in the Genesis community, it aims to help them reach a wider audience and give a little inspiration to those of us making stuff with Genesis too. I hope you enjoy it. &#8211; Nick<\/em><\/p>\n<hr \/>\n<p><strong>His real name is <a href=\"http:\/\/twitter.com\/calvin_makes\" target=\"_blank\">Calvin Koepke<\/a>, but you might know him as <a href=\"http:\/\/twitter.com\/calvin_makes\" target=\"_blank\">Calvin Makes<\/a>. Whatever you call him though Calvin is pulling up trees in the Genesis community right now.<\/strong><\/p>\n<p>Not only has he just launched <a href=\"http:\/\/my.studiopress.com\/themes\/community\/\" target=\"_blank\">Community Pro<\/a> with <a href=\"https:\/\/twitter.com\/avclark\" target=\"_blank\">Adam Clark<\/a>, a gorgeous new Genesis theme currently featured on StudioPress&#8217; website, but he&#8217;s also got a bunch of excellent <a href=\"http:\/\/www.calvinmakes.com\/free-themes\" target=\"_blank\">free Genesis themes<\/a> on his website, frequently <a href=\"http:\/\/www.calvinmakes.com\/learn\/\" target=\"_blank\">shares his expertise on his blog<\/a>, and he&#8217;s planning the launch of another Genesis based project called <a href=\"http:\/\/timberbit.io\/\" target=\"_blank\">TimberBit.<\/a><\/p>\n<p>(Oh and if that wasn&#8217;t enough, he&#8217;s just released a beautiful new Genesis theme, <a href=\"http:\/\/www.calvinmakes.com\/introducing-concise-premium-genesis-child-theme\/\" target=\"_blank\">Concise<\/a>, too).<\/p>\n<p>In-between doing all of the above, Calvin took a little time out to tell me about the business lessons learned with Community Pro, who he looks up to in the Genesis community (and beyond), and what it&#8217;s like working with Adam Clark.<\/p>\n<p>Plus he&#8217;s generously offered to give away, not one, but two Genesis themes, <a href=\"http:\/\/my.studiopress.com\/themes\/community\/\" target=\"_blank\">Community Pro<\/a> and <a href=\"http:\/\/www.calvinmakes.com\/introducing-concise-premium-genesis-child-theme\/\" target=\"_blank\">Concise<\/a>, to GenesisWP.guide readers too (more details at the end of the interview).<\/p>\n<hr \/>\n<h2>For those that don’t know, tell us a little bit about yourself, where do you live, what do you do and what makes you tick?<\/h2>\n<blockquote><p>I’m just a guy who thinks way too much, doesn’t know which ideas to keep and which to throw away, and who doesn’t like to settle for a typical routine.<\/p>\n<p>I’ve grown up in Montana all my life and don’t plan on leaving anytime soon—I think it’s largely because I need the contrast of nature and tech. When I’m done with work, I want to listen to the world as it has always been, and without all the digital noise.<\/p><\/blockquote>\n<h2>How did you first get into Genesis web development and how long have you been working with it?<\/h2>\n<blockquote><p>I was introduced to Genesis back in 2013 when I used to work for Sundog Media, a design and development firm located in Alaska. It was a brand-new framework for me at the time, but I quickly saw the speed and flexibility that it offered.<\/p>\n<p>I started building themes for my personal blog (about one theme a month, probably to the annoyance of my readers), messing around with varying levels of complexity and design.<\/p>\n<p>Since then, I’ve worked exclusively with the framework, and don’t plan on going back to basic WordPress ever again.<\/p><\/blockquote>\n<h2>What are the biggest reasons to work with Genesis for you?<\/h2>\n<blockquote><p>In my opinion, it’s largely due to the community. It’s small enough that you can know just about everyone working with it, but it’s big enough that there is room for growth and continued discovery.<\/p>\n<p>That’s something that you just can’t find in the WordPress community—it’s just too big, and it’s hard to find a niche.<\/p>\n<p>Of course, it’s also obviously a no-brainer if you’re looking for crazy good stability and speed for your themes. You don’t have to worry about updating core WordPress standards (most of the time), and you can be a beginner developer or an advanced one, and it suits both levels of skill equally well.<\/p><\/blockquote>\n<h2>Away from Genesis and web development, tell us something about yourself that maybe a lot of the people in the Genesis community might not know?<\/h2>\n<blockquote><p>Besides having superhuman ninja skills, the only thing I can think of is that most people might not know is that I have played the piano all my life. I’ve played guitar, and bass guitar as well, but nothing ever has come close to the piano.<\/p>\n<p>I remember time when I would just sit down in front of the grand piano at my church and play non-stop for literally an hour, without any sheet music or anything in front of me.<\/p>\n<p>It was one of the few things that allowed me to pour out everything in my heart without needing to describe it through words, and I often felt like it was the most accurate.<\/p><\/blockquote>\n<h2>What’s it like working with Adam Clark 🙂 ?<\/h2>\n<blockquote><p>Working with Adam is a blast. He’s an extremely down-to-earth guy with a good sense of forethought and intuition. Community Pro was actually his idea and design—I just came along and helped him out with building it.<\/p>\n<p>Also, <a href=\"http:\/\/avclark.com\/tgm\/\" target=\"_blank\">his podcast<\/a> is the bomb.<\/p><\/blockquote>\n<h2>Big congrats on the launch of Community Pro. How did it all go? Any last minute freak outs, surprises (good or bad) or stories you can share?<\/h2>\n<blockquote><p><a href=\"http:\/\/my.studiopress.com\/themes\/community\/\" target=\"_blank\">Community Pro<\/a> was as stressful as any new theme launch is, I guess. But it wasn’t all that bad. The only last-minute freakout was when we decided to change the name (it was Church Pro at the beginning).<\/p>\n<p>I had to go through the entire theme and change all the functions and terminology. I think I sent Brian about 5 different versions with updates as I found them, and this was even before the launch—thankfully, he didn’t get fed-up with me and still decided to put it on StudioPress. 😉<\/p><\/blockquote>\n<h2>For people that don’t know, what’s the backstory to Community Pro, what made you decide to do it and why now?<\/h2>\n<blockquote><p>Like I said earlier, Community Pro was originally Adam’s idea and design. He simply approached me one day and asked if I’d like to help build it—he was swamped with work at the time, and so it had been sitting on the back-burner, waiting to be built.<\/p>\n<p>I decided it was definitely worth the experience, not to mention the chance to work with a guy who’s design I so admired.<\/p><\/blockquote>\n<h2>How is your time split at the moment between Community Pro and other work? Do you plan shift more of your time to Community Pro if things go well or do you see it strictly as a side project?<\/h2>\n<blockquote><p>This is a tough one. Community Pro has the potential to become something more than it is&#8230;but, like I mentioned earlier, I usually have so many ideas going through my mind, it’s hard to decide which ones to pursue and which ones to table.<\/p>\n<p>At the moment, Community Pro is a little more than a side-project, but definitely not a full-time one. I actually have several other things going on right now as well, one of them being <a href=\"http:\/\/timberbit.io\/\" target=\"_blank\">TimberBit<\/a>, so it’s hard to say what Community Pro will become in the future.<\/p>\n<p>One thing I know for sure though is the positive response to it, and that’s always something to pay attention to.<\/p><\/blockquote>\n<h2>Have you set targets for Community Pro (financial or otherwise)? (Will you still speak to us when it makes you rich and (Internet) famous?)<\/h2>\n<blockquote><p>There aren’t really any targets for Community Pro right now. It’s more of an experiment at the moment, since this is both Adam’s and my first premium theme.<\/p>\n<p>And I don’t see myself getting famous anytime soon, but yes, I’d definitely speak to everyone I’ve ever met. 😉<\/p><\/blockquote>\n<h2>Have you given much thought about how you’ll distinguish what you’re doing from other offerings? If so, how do you plan to do so?<\/h2>\n<blockquote><p>This is probably where my website, <a href=\"http:\/\/www.calvinmakes.com\/\" target=\"_blank\">Calvin Makes<\/a>, comes in. It’s funny because “Makes” has sort of turned into a pseudo last-name for me, but it was never intended as such—my last name is actually “Koepke” (good luck with pronouncing that).<\/p>\n<p>The Calvin Makes website was meant to be the hub for everything I “make”, whether that be Community Pro, TimberBit, tutorials, or just <a href=\"http:\/\/www.calvinmakes.com\/free-themes\/\" target=\"_blank\">free themes<\/a> in general.<\/p>\n<p>So it’s pretty safe to say that this is where you’ll find out about anything new or current that I’m working on.<\/p><\/blockquote>\n<h2>What do you think of the current state of the Genesis theme market?<\/h2>\n<blockquote><p>I think it’s alive and well. I’ve always thought that the Genesis theme market is different than your average WordPress market in that what people are really buying is the design of the child theme.<\/p>\n<p>Since most child themes offer the same functionality, the design ends up being what sets them apart. Being first a designer at heart, this is extremely enticing to me and is part of what makes the community so fun to be a part of.<\/p>\n<p>Although, I think there is a niche that has yet to be filled, and that’s probably “made for everyone” Genesis child themes that are very flexible and versatile.<\/p><\/blockquote>\n<h2>What are your thoughts on marketing Community Pro and who do you expect your typical customer to be?<\/h2>\n<blockquote><p>So far, our typical customer has been developers who use it for their client’s site. However, I’ve also seen people purchase it for use on their personal blogs and portfolios.<\/p>\n<p>Marketing the theme right now is not something that we have the bandwidth for, so it’s purely rolling on referrals and StudioPress exposure. There might be plans in the near future though for upping the marketing—we’ll just have to see. 😉<\/p><\/blockquote>\n<h2>Are there any other WordPress businesses you particularly look up to, either inside or outside of the Genesis community to <del>copy<\/del> get inspiration from (and why)?<\/h2>\n<blockquote><p>One of the top WordPress theme shops that I admire is <a href=\"https:\/\/array.is\/\" target=\"_blank\">Array<\/a>. I can’t get over the beautiful design, amazing integration of support and services like TypeKit, and that fact that it’s run by a very small team.<\/p>\n<p>Beyond that, <a href=\"https:\/\/twitter.com\/bgardner\" target=\"_blank\">Brian Gardner&#8217;s<\/a> designs are always something to be admired, along with <a href=\"https:\/\/twitter.com\/laurenmancke\" target=\"_blank\">Lauren Mancke<\/a>, <a href=\"https:\/\/twitter.com\/seesaw_design\" target=\"_blank\">Brook Semple<\/a>, and of course (outside of Genesis) <a href=\"https:\/\/twitter.com\/brian_lovin\" target=\"_blank\">Brian Lovin<\/a> at Buffer.<\/p><\/blockquote>\n<h2>Having launched, what’s the one piece of advice you’d give to other creators in the Genesis space that are thinking of launching their own projects?<\/h2>\n<blockquote><p>Put in the extra work for the future benefit. There were many times when I just wanted to be done with Community Pro, but if I had stopped early the theme wouldn’t have been nearly as good.<\/p>\n<p>In fact, there were probably still some things that I could’ve addressed before launch that would’ve saved me from having to push updates after the release.<\/p>\n<p>Safe yourself the stress of fixing problems when everyone is watching and do it beforehand. Give the theme to a few trusted friend and have them offer feedback.<\/p>\n<p>At the end of the day though, make sure you launch. 😉<\/p><\/blockquote>\n<h2>What’s next for Community Pro?<\/h2>\n<blockquote><p>At this point, that is yet to be decided. It depends heavily on what people want it to be—so far, the response has been overwhelmingly positive, so it’s hard to say what it might evolve into.<\/p>\n<p>We’ve talked about adding support for premium plugin add-ons, additional stylesheets for purchase, and a lot of other extendable features that we are still working through.<\/p>\n<p>In the end, it’ll all depend on whether or not the Genesis community wants it, and that’s determined by how it performs over the next few months—which so far as been quite good!<\/p><\/blockquote>\n<h2>Tell me a bit more about TimberBit?<\/h2>\n<blockquote><p><a href=\"http:\/\/timberbit.io\/\" target=\"_blank\">TimberBit<\/a> is actually a fun project that I started, with the intention of finding beautifully designed WordPress themes on the market, and making those available for Genesis users.<\/p>\n<p>I’m actually about 70% done with the first theme that I will release, but I’m not quite ready yet to announce which theme it is. 😉<\/p>\n<p>It’s also a sort of experiment—in order to convert these themes I have to get extended licenses from the original theme authors, not to mention their permission. Because of this, they have a higher up-front cost, and therefore a longer time-period before I start making that initial investment back.<\/p>\n<p>I’m still trying to figure out a good payment model for this, because I really want it to be worth it. There are so many beautiful themes out there on marketplaces like ThemeForest, but often times their code is bloated and they are packed with an overwhelming amount of options.<\/p>\n<p>TimberBit is my attempt to make these themes simpler and Genesis supported, yet with all the great design as the original.<\/p><\/blockquote>\n<h2>Finally, and most importantly, Downton Abbey or Game of Thrones?<\/h2>\n<blockquote><p>I’ve never watched either so it’s hard to say. Call me sheltered 😉<\/p><\/blockquote>\n<h2>What’s the best way for people to get in touch with you if they want to learn more?<\/h2>\n<blockquote><p>They can follow me on Twitter (<a href=\"http:\/\/twitter.com\/calvin_makes\" target=\"_blank\">@calvin_makes<\/a>), or they can email me directly at hello [at] calvinmakes [dot] com. I always love connecting with new people, even if that’s just to get to know them or help them with a problem they might be having.<\/p><\/blockquote>\n<hr \/>\n<h2 id=\"giveaway\" style=\"text-align: center;\">Giveaway: Win two of Calvin&#8217;s themes!<\/h2>\n<p style=\"text-align: center;\"><strong>For your chance of winning a copy of the <a href=\"http:\/\/my.studiopress.com\/themes\/community\/\" target=\"_blank\">Community Pro theme<\/a> and Calvin&#8217;s new <a href=\"http:\/\/www.calvinmakes.com\/introducing-concise-premium-genesis-child-theme\/\" target=\"_blank\">Concise theme<\/a> just enter your email address below.<\/strong><br \/>\n<em>(Competition closes 11:59pm PST, 11 May 2015)<\/em><\/p>\n<p style=\"text-align: center;\"><p>This giveaway has now finished, but look out for new chances to win cool stuff in future articles.<\/p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Genesis community rockstar Calvin Makes talks Community Pro theme, who he looks up to in WordPress and working with Adam Clark.<\/p>\n","protected":false},"author":2,"featured_media":100,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"spay_email":""},"categories":[16],"tags":[],"jetpack_featured_media_url":"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/calvin-makes.jpg","yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<meta name=\"description\" content=\"Genesis community rockstar Calvin Makes talks Community Pro theme, who he looks up to in WordPress and working with Adam Clark.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/genesiswp.guide\/calvin-makes-interview\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"An interview with Calvin Makes (plus win Genesis themes)\" \/>\n<meta property=\"og:description\" content=\"Genesis community rockstar Calvin Makes talks Community Pro theme, who he looks up to in WordPress and working with Adam Clark.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/genesiswp.guide\/calvin-makes-interview\/\" \/>\n<meta property=\"og:site_name\" content=\"GenesisWP.guide\" \/>\n<meta property=\"article:published_time\" content=\"2015-05-06T12:55:45+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-05-11T22:34:54+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/calvin-makes.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"660\" \/>\n\t<meta property=\"og:image:height\" content=\"440\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/genesiswp.guide\/#website\",\"url\":\"https:\/\/genesiswp.guide\/\",\"name\":\"GenesisWP.guide\",\"description\":\"The best new WordPress Genesis things\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/genesiswp.guide\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/genesiswp.guide\/calvin-makes-interview\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/genesiswp.guide\/wp-content\/uploads\/2015\/05\/calvin-makes.jpg\",\"width\":660,\"height\":440,\"caption\":\"Calvin Makes\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/genesiswp.guide\/calvin-makes-interview\/#webpage\",\"url\":\"https:\/\/genesiswp.guide\/calvin-makes-interview\/\",\"name\":\"An interview with Calvin Makes (plus win Genesis themes!)\",\"isPartOf\":{\"@id\":\"https:\/\/genesiswp.guide\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/genesiswp.guide\/calvin-makes-interview\/#primaryimage\"},\"datePublished\":\"2015-05-06T12:55:45+00:00\",\"dateModified\":\"2015-05-11T22:34:54+00:00\",\"author\":{\"@id\":\"https:\/\/genesiswp.guide\/#\/schema\/person\/b5cc53502a0c6971db47f22c6d57babb\"},\"description\":\"Genesis community rockstar Calvin Makes talks Community Pro theme, who he looks up to in WordPress and working with Adam Clark.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/genesiswp.guide\/calvin-makes-interview\/\"]}]},{\"@type\":[\"Person\"],\"@id\":\"https:\/\/genesiswp.guide\/#\/schema\/person\/b5cc53502a0c6971db47f22c6d57babb\",\"name\":\"Nick Davis\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/genesiswp.guide\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/015e3d0d2b959afa2ce18901b2d64ab2?s=96&d=mm&r=g\",\"caption\":\"Nick Davis\"},\"description\":\"Nick has been playing with websites since 1997, WordPress since 2010 and still hasn't broken the Internet. Tweet him up at @iamnickdavis.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts\/98"}],"collection":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/comments?post=98"}],"version-history":[{"count":0,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/posts\/98\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/media\/100"}],"wp:attachment":[{"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/media?parent=98"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/categories?post=98"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/genesiswp.guide\/wp-json\/wp\/v2\/tags?post=98"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}